---
kind: method
id: M:Autodesk.Revit.DB.FailureHandlingOptions.GetTransactionFinalizer
source: html/7758a257-044e-29ac-5e27-470509d70635.htm
---
# Autodesk.Revit.DB.FailureHandlingOptions.GetTransactionFinalizer Method

Gets the callback to be executed after transaction is completed.

## Syntax (C#)
```csharp
public ITransactionFinalizer GetTransactionFinalizer()
```

## Returns
The callback to be executed after transaction is completed.